# GetTileRepetitionPoint

## Description
Gets the specified tile resource's repetition point.

```pascal
PROCEDURE GetTileRepetitionPoint(
				tileHandle          : HANDLE;
				VAR repetitionPoint : REAL);
```

```python

def vs.GetTileRepetitionPoint(tileHandle):
    return repetitionPoint
```

## Parameters
|Name|Type|Description|
|---|---|---|
|tileHandle|HANDLE|The tile resource from which to get the repetition point.|
|repetitionPoint|REAL|The retrieved repetition point.|

## Examples
```pascal
GetTileRepetitionPoint(tileHandle, repetitionPoint);
```

## See Also
VS Functions:
CreateTile| ShowEditTileDialog| ShowEditTileSettingsDialog| ShowNewTileDialog| GetTileGeometryGroup| BeginGroupN| AddTileGeometryObject| GetTileGroupParent| IsTileGroupContainedObject| GetTileBackgroundColor| SetTileBackgroundColor| GetTileRepetitionPoint| SetTileRepetitionPoint| GetTileOffsetPoint| SetTileOffsetPoint

## Version
Availability: from Vectorworks 2011
## Category
* Document Attributes